blog_project/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id

    if @article.save
---
INSERT INTO "articles" ("title", "content", "topic", "tags", "created_at", "updated_at", "user_id", "public") VALUES (?, ?, ?, ?, ?, ?, ?, ?)